package org.zyd.common.constants;

/**
 * 
 * 错误编码
 *
 */
public enum ErrorCode {
	EZYD0001("系统错误"),
	EZYD0002("数据库错误"),
	EZYD0003("会员ID与操作者ID不一致"),
	EZYD0004("不存在所要操作的记录"),
	EZYD0005("不存在赠品"),
	
	EZYDE001("推荐码不存在"),
	EZYDE002("手机不能为空"),
	EZYDE003("手机格式不正确"),
	EZYDE004("密码不能为空"),
	EZYDE005("密码长度不足"),
	EZYDE006("姓名不能为空"),
	EZYDE007("姓名格式不正确"),
	EZYDE008("姓名长度最大为5个汉字"),
	EZYDE009("妮称不能为空"),
	EZYDE010("妮称格式不正确"),
	EZYDE011("妮称长度最大为10个字符"),
	EZYDE012("出身年月不能为空"),
	EZYDE013("会员不存在"),
	EZYDE014("联系信息类型不能为空"),
	EZYDE015("联系信息联系人姓名不能为空"),
	EZYDE016("联系信息联系人手机不能为空"),
	EZYDE017("联系信息联系人手机格式不正确"),
	EZYDE018("联系信息省份不能为空"),
	EZYDE019("联系信息城市不能为空"),
	EZYDE020("联系信息区、镇不能为空"),
	EZYDE021("联系信息详细地址不能为空"),
	EZYDE022("联系信息邮编号码格式不正确"),
	EZYDE023("联系信息不存在"),
	EZYDE024("手机号码已存在"),
	EZYDE025("会员id不能为空"),
	EZYDE026("会员账号不存在"),
	EZYDE027("账号已是锁定状态"),
	EZYDE028("账号已是解锁状态"),
	EZYDE029("密码已经被锁定"),
	EZYDE030("新密码与原密码相同"),
	EZYDE031("密码不存在"),
	EZYDE032("商品不存在"),
	EZYDE033("商品已经被收藏"),
	EZYDE034("商品未被会员收藏"),
	EZYDE035("商品已经加入购物车"),
	EZYDE036("购物车商品数量不能小于1"),
	EZYDE037("商品不在购物车"),
	EZYDE038("密码格式不正确"),
	EZYDE039("积分余额不足"),
	
	
	
	EZYDH000("商品录入人不能为空"),
	EZYDH001("商品类型不能为空"),
	EZYDH002("商品名称不能为空"),
	EZYDH003("商品名称最大为25个字符"),
	EZYDH004("商品描述最大200个字符"),
	EZYDH005("商品库存量不能小于0"),
	EZYDH006("商品指导价不能为空"),
	EZYDH007("商品指导价必须大于0"),
	EZYDH008("商品单价不能为空"),
	EZYDH009("商品单价必须大于0"),
	EZYDH010("商品上架时间不能为空"),
	EZYDH011("商品默认图片地址不能为空"),
	EZYDH012("商品默认图片地址最大为200个字符"),
	EZYDH013("紫砂壶器型不能为空"),
	EZYDH014("紫砂壶壶型不能为空"),
	EZYDH015("紫砂壶泥料不能为空"),
	EZYDH016("紫砂壶容量不能为空"),
	EZYDH017("紫砂壶容量必须大于0"),
	EZYDH018("紫砂壶级别不能为空"),
	EZYDH019("紫砂壶价格区间不能为空"),
	EZYDH020("茶叶类型不能为空"),
	EZYDH021("茶叶产地不能为空"),
	EZYDH022("茶叶等级不能为空"),
	EZYDH023("茶叶包装方式不能为空"),
	EZYDH024("茶叶价格区间不能为空"),
	EZYDH025("商品图片类型不能为空"),
	EZYDH026("商品图片地址不能为空"),
	EZYDH027("商品图片地址最大为200个字符"),
	//EZYDH028("图片列表不能为空"),
	EZYDH029("图片列表中没有商品图"),
	EZYDH030("图片列表中没有商品图（大）"),
	EZYDH031("图片列表中没有商品详情图"),
	EZYDH032("包装清单不能为空"),
	EZYDH033("包装清单描述不能为空"),
	EZYDH034("包装清单描述最大为50个字符"),
	EZYDH035("包装清单数量不能为空"),
	EZYDH036("包装清单数量不能超过1000"),
	EZYDH037("商品库存量不能超过10000"),
	EZYDH038("商品属性名称不能为空"),
	EZYDH039("商品属性名称最大为15个字符"),
	EZYDH040("商品属性值不能为空"),
	EZYDH041("商品属性值最大为30个字符"),
	EZYDH042("商品已经审核通过"),
	EZYDH043("非法商品编号"),
	EZYDH044("商品属性不存在"),
	EZYDH045("包装清单数量不能小于0"),
	EZYDH046("包装清单不存在"),
	EZYDH047("包装清单已经存在"),
	EZYDH048("资询内容不能为空"),
	EZYDH049("资询内容最大为300个字符"),
	EZYDH050("资询不存在"),
	EZYDH051("资询回复人不能为空"),
	EZYDH052("资询回复人最大为10个字符"),
	EZYDH053("资询回复内容不能为空"),
	EZYDH054("资询回复内容最大为300个字符"),
	EZYDH055("标签不存在"),
	EZYDH056("商品已经设置了其它标签"),
	EZYDH057("商品推荐关系已经存在"),
	EZYDH058("商品推荐关系不存在"),
	EZYDH059("商品推荐超出上限，最多推荐5个商品"),
	EZYDH060("赠品关系已经存在"),
	EZYDH061("赠品关系不存在"),
	EZYDH062("商品赠品超出上限，最多5个赠品"),
	EZYDH063("被推荐商品不存在"),
	EZYDH064("赠品商品不存在"),
	
	
	
	
	
	EZYDP001("订单不存在"),
	EZYDP002("商品重复评论"),
	EZYDP003("评价星级取值范围1-5"),
	EZYDP004("评价内容不能为空"),
	EZYDP005("评价内容不能少于5个字符"),
	EZYDP006("评价内容最大为300个字符"),
	EZYDP007("评价标签id对应的标签不存在"),
	EZYDP008("新评价标签最大为10个字符"),
	EZYDP009("评价图片地址最大为200个字符"),
	EZYDP010("评价不存在"),
	EZYDP011("评价已经被屏蔽"),
	EZYDP012("评价回复内容不能为空"),
	EZYDP013("评价回复内容不能少于5个字符"),
	EZYDP014("评价回复内容最大为300个字符"),
	EZYDP015("追评内容不能为空"),
	EZYDP016("追评内容不能少于5个字符"),
	EZYDP017("追评内容最大为300个字符"),
	
	
	
	
	
	
	EZYDR001("商品购买数量必须大于0"),
	EZYDR002("商品库存余量不足"),
	EZYDR003("积分使用量不能小于0"),
	EZYDR004("订单备注最大为100个字符"),
	EZYDR005("收货地址信息不能为空"),
	EZYDR006("联系id对应的地址不存在"),
	EZYDR007("联系id对应的地址不属于该会员"),
	EZYDR008("订单支付方式不能为空"),
	EZYDR009("暂不支持开具增值发票"),
	EZYDR010("发票抬头最大为100个字符"),
	EZYDR011("订单状态不正确，不支持取消操作"),
	EZYDR012("订单状态不正确，不支持支付操作"),
	EZYDR013("支付账号不能为空"),
	EZYDR014("支付账号最大为100个字符"),
	EZYDR015("支付单号不能为空"),
	EZYDR016("支付单号最大为50个字符"),
	EZYDR017("支付渠道不能为空"),
	EZYDR018("订单状态不正确，不支持发货操作"),
	EZYDR019("物流公司代码不能为空"),
	EZYDR020("物流公司名称不能为空"),
	EZYDR021("物流公司名称最大为10个字符"),
	EZYDR022("物流单号不能为空"),
	EZYDR023("物流单号最大为50个字符"),
	EZYDR024("订单状态不正确，不支持申请退款操作"),
	EZYDR025("退款申请原因不能为空"),
	EZYDR026("退款申请原因最大为150个字符"),
	EZYDR027("订单状态不正确，不支持退款操作"),
	EZYDR028("订单状态不正确，不支持确认收货操作"),
	EZYDR029("订单状态不正确，不支持取消退款申请操作"),
	EZYDR030("订单状态不正确，不支持拒收操作"),
	EZYDR031("拒收原因不能为空"),
	EZYDR032("拒收原因最大为150个字符"),
	
	EZYDR033("退换货订单不存在"),
	EZYDR034("退换货订单状态不正确，不支持审批操作"),
	EZYDR035("退换货订单状态不正确，不支持寄件操作"),
	EZYDR036("物流费用不能为空"),
	EZYDR037("物流费用不能小于0"),
	EZYDR038("退换货订单状态不正确，不支持寄件拒收操作"),
	EZYDR039("退换货订单状态不正确，不支持寄件收件操作"),
	EZYDR040("退换货订单状态不正确，不支持退款操作"),
	EZYDR041("退换货订单类型不正确，不支持发货操作"),
	EZYDR042("退换货订单状态不正确，不支持发货操作"),
	EZYDR043("退换货订单类型不正确，不支持收货操作"),
	EZYDR044("退换货订单状态不正确，不支持收货操作"),
	EZYDR045("退换货订单类型不正确，不支持拒收操作"),
	EZYDR046("退换货订单状态不正确，不支持拒收操作"),
	EZYDR047("退换货订单类型不正确，不支持退款申请操作"),
	EZYDR048("退换货订单状态不正确，不支持退款申请操作"),
	EZYDR049("退换货订单类型不正确，不支持取消退款申请操作"),
	EZYDR050("退换货订单状态不正确，不支持取消退款申请操作"),
	
	
	
	
	
	
	
	
	
	
	
	EZYDZ999("");
	
	private String desc;
	
	public String getDesc() {
		return this.desc;
	}
	
	private ErrorCode(String desc) {
		this.desc = desc;
	}
}
